infoModule.controller('infoController', ['$scope', function ($scope) {
    $scope.text = 'История запросов';
    
    $scope.requests = {
        today: {
            "data": [68, 15, 34],
            "labels": ["Отправлены на подпись", "В процессе", "Подписаны"]
        },
        week: {
            labels: ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"],
            series: ['Отправлено', 'Подписано'],
            data: [
                [28, 48, 40, 19, 86, 27, 90],
                [65, 59, 80, 81, 56, 55, 40]
            ]
        },
        month: {
            labels: ["Январь", "Февраль", "Март", "Апрель", "Май"],
            series: ['Отправлено', 'Подписано'],
            data: [
                [1486, 879, 1876, 562, 1029],
                [1057, 699, 1586, 754, 785]
            ]
        }
    };
    
    $scope.docs = {
        today: {
            "data": [1, 15, 5, 8],
            "labels": ["Загружены", "Готовы к отправке", "Успешно подписаны", "Изменены"]
        },
        week: {
            labels: ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"],
            series: ['Запрошено PDF'],
            data: [
                [56, 43, 12, 67, 89, 34, 59]
            ]
        },
        month: {
            labels: ["Январь", "Февраль", "Март", "Апрель", "Май"],
            series: ['Отправлено', 'Подписано'],
            data: [
                [1486, 879, 1876, 562, 1029],
                [1057, 699, 1586, 754, 785]
            ]
        }
    };
    
    $scope.chart1 = {
        "series": ["SeriesA"],
        "data": [["90", "99", "80", "91", "76", "75", "60", "67", "59", "55"]],
        "labels": ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10"],
        "colours": [{ // default
            "fillColor": "rgba(224, 108, 112, 1)",
            "strokeColor": "rgba(207,100,103,1)",
            "pointColor": "rgba(220,220,220,1)",
            "pointStrokeColor": "#fff",
            "pointHighlightFill": "#fff",
            "pointHighlightStroke": "rgba(151,187,205,0.8)"
        }]
    };
    
}]);

//"series": ["SeriesA"],
//       "data": [["90", "99", "80", "91", "76", "75", "60", "67", "59", "55"]],
//       "labels": ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10"],
//       "colours": [{ // default
//           "fillColor": "rgba(224, 108, 112, 1)",
//           "strokeColor": "rgba(207,100,103,1)",
//           "pointColor": "rgba(220,220,220,1)",
//           "pointStrokeColor": "#fff",
//           "pointHighlightFill": "#fff",
//           "pointHighlightStroke": "rgba(151,187,205,0.8)"
//       }]
//}